app/controllers/equipment_controller.rb

  def create
    @user = User.find(params[:user_id])
    @equipment = @user.equipment.create(equipment_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "equipment" ("typ", "make", "info", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["typ", "bass"], ["make", "Kay"], ["info", "1961"], ["user_id", 1], ["created_at", "2015-09-29 21:21:40.110359"], ["updated_at", "2015-09-29 21:21:40.110359"]]

  def destroy
    @user = User.find(params[:user_id])
    @equipment = @user.equipment.find(params[:id])
    @equipment.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "equipment".* FROM "equipment" WHERE "equipment"."user_id" = ? AND "equipment"."id" = ? LIMIT 1  [["user_id", 1], ["id", 3]]
DELETE FROM "equipment" WHERE "equipment"."id" = ?  [["id", 3]]