app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("name", "email", "password", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pig"], ["email", "pig@pig.pig"], ["password", "password"], ["location", "San Francisco"], ["created_at", "2015-09-29 22:22:02.361894"], ["updated_at", "2015-09-29 22:22:02.361894"]]